3A/SE465/Fuzzing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-21 Wed 16:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Fuzzing</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Fuzzing</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgba3afc9">1. Fuzzing</a>
<ul>
<li><a href="#orgd1e21c0">1.1. Goal</a></li>
<li><a href="#org1f5c0ec">1.2. Mutation-Based Fuzzing</a>
<ul>
<li><a href="#orgb485758">1.2.1. Grammar-Based Fuzzing</a></li>
<li><a href="#orgbdc851f">1.2.2. Guiding by Coverage</a></li>
</ul>
</li>
<li><a href="#orge47766e">1.3. Gerybox Fuzzing</a>
<ul>
<li><a href="#orgc0071ed">1.3.1. Directed Gerybox Fuzzing</a></li>
</ul>
</li>
<li><a href="#orgc816f90">1.4. Search-Based Fuzzing</a>
<ul>
<li><a href="#org162db03">1.4.1. Hillclimbing Algorithm</a></li>
<li><a href="#org79e4758">1.4.2. Genetic Algorithm</a></li>
</ul>
</li>
<li><a href="#orgc5a2b65">1.5. Problems with Fuzzing</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgba3afc9" class="outline-2">
<h2 id="orgba3afc9"><span class="section-number-2">1.</span> Fuzzing</h2>
<div class="outline-text-2" id="text-1">
<p>
Set of automated testing techniques that identifies abnormal program behaviours by
evaluating how the tested program responds to various random inputs.
</p>

<p>
Basic fuzzer is purely random:
</p>
<ul class="org-ul">
<li>easy to implement and fast, but relies on luck and has shallow program exploration.</li>
</ul>

<p>
Fuzzer categories:
</p>
<ul class="org-ul">
<li><b>generation-based</b>: inputs generated from scratch</li>
<li><b>mutation-based</b>: inputs from modifying existing inputs</li>
<li><b>dumb</b> or <b>smart</b> depending on awareness of input structure</li>
<li><b>white/grey/black box</b> depending on awareness of program structure</li>
</ul>
</div>
<div id="outline-container-orgd1e21c0" class="outline-3">
<h3 id="orgd1e21c0"><span class="section-number-3">1.1.</span> Goal</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Find real bugs</li>
<li>Reduce the number of false positives
<ol class="org-ol">
<li>generate reasonable input</li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-org1f5c0ec" class="outline-3">
<h3 id="org1f5c0ec"><span class="section-number-3">1.2.</span> Mutation-Based Fuzzing</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Take existing input</li>
<li>Randomly modify it</li>
<li>Pass it to the program</li>
</ol>
</div>
<div id="outline-container-orgb485758" class="outline-4">
<h4 id="orgb485758"><span class="section-number-4">1.2.1.</span> Grammar-Based Fuzzing</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Grammars can easily formally specify input languages.
</p>

<p>
A simple grammar fuzzer:
</p>
<ol class="org-ol">
<li>starts with the start symbol then keeps expanding it</li>
<li>to avoid expansion to infinite inputs, place a limit on the # of nonterminals</li>
<li>to avoid being stuck in a situation where we cannot reduce the number of symbols
further, limit the total # of expansion steps</li>
</ol>

<p>
Grammar generated inputs can be seeds in mutation-based fuzzing.
</p>
</div>
</div>
<div id="outline-container-orgbdc851f" class="outline-4">
<h4 id="orgbdc851f"><span class="section-number-4">1.2.2.</span> Guiding by Coverage</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Retrieve coverage of a test run and evolve inputs that are successful (where a new
path was found during test execution).
</p>
</div>
</div>
</div>
<div id="outline-container-orge47766e" class="outline-3">
<h3 id="orge47766e"><span class="section-number-3">1.3.</span> Gerybox Fuzzing</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<b>Power schedule</b>: distributes fuzzing time among the seeds in the population
</p>

<p>
<b>Objective</b>: maximize the time spend fuzzing the seeds that lead to higher coverage
increase in shorter time.
</p>

<p>
<b>Seed Energy</b>: likelihood with which a seed is chosen from a population
</p>
</div>
<div id="outline-container-orgc0071ed" class="outline-4">
<h4 id="orgc0071ed"><span class="section-number-4">1.3.1.</span> Directed Gerybox Fuzzing</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Implement a power schedule that assigns more energy to seeds with a low distance
to the target function:
</p>
<ul class="org-ul">
<li>build a call graph among function in a program</li>
<li>for each function executed in the test, calculate its shortest path to the
target function, then do an average distance, using the distance to calculate
the power schedule</li>
<li>can do more complex calculation by considering finer grained info</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc816f90" class="outline-3">
<h3 id="orgc816f90"><span class="section-number-3">1.4.</span> Search-Based Fuzzing</h3>
<div class="outline-text-3" id="text-1-4">
<p>
For deriving specific test inputs that achieve some objective.
Uses domain knowledge of which inputs is closest to what one is looking for.
</p>
</div>
<div id="outline-container-org162db03" class="outline-4">
<h4 id="org162db03"><span class="section-number-4">1.4.1.</span> Hillclimbing Algorithm</h4>
<div class="outline-text-4" id="text-1-4-1">
<ol class="org-ol">
<li>Take a random starting point</li>
<li>Determine fitness value of all neighbours</li>
<li>Move to the neighbour with the best fitness value</li>
<li>If solution not found, back to step 2.</li>
</ol>
</div>
</div>
<div id="outline-container-org79e4758" class="outline-4">
<h4 id="org79e4758"><span class="section-number-4">1.4.2.</span> Genetic Algorithm</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
Based on the idea that solutions can be genetically encoded, based on natural
selection.
A fitness function takes the info contained in the description and evaluates
properties.
</p>

<p>
Emulates natural evolution with the following process:
</p>
<ul class="org-ul">
<li>create an initial population of random chromosomes</li>
<li>select fit individuals for reproduction</li>
<li>generate new population through reproduction of selected individuals
(selecting parents and creating mutations)</li>
<li>continue until an optimal solution or limit reached</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgdd43fa6"></a>Challenge 1: Feeding Inputs<br />
<div class="outline-text-5" id="text-1-4-2-1">
<p>
The fuzzing engine executes the fuzz target many times, so the target must:
</p>
<ul class="org-ul">
<li>tolerate any kind of input</li>
<li>not exit on any input</li>
<li>join all threads at the end</li>
<li>be fast and as deterministic as possible</li>
<li>not modify any global state</li>
<li>be as narrow as possible</li>
</ul>
</div>
</li>
<li><a id="org8024185"></a>Challenge 2: Detecting Abnormal Behaviour<br />
<div class="outline-text-5" id="text-1-4-2-2">
<p>
Refers to crashes, triggerring user-provided assertion failure, hanging,
or allocating too much memory.
</p>

<p>
For early crash detection use sanitizers for address, thread, memory,
undefined behaviour, or leaks.
</p>
</div>
</li>
<li><a id="org46407de"></a>Challenge 3: Ensuring Progress<br />
<div class="outline-text-5" id="text-1-4-2-3">
<p>
Use coverage to evolve test cases that find new paths through program
execution, with Gerybox or search-based approaches.
</p>

<p>
Coverage with American Fuzzy Lop captures branch coverage by
instrumenting compiled programs which is fast.
</p>
</div>
</li>
<li><a id="orgc9bb2f2"></a>Challenge 4: Coming up with Interesting Inputs<br />
<div class="outline-text-5" id="text-1-4-2-4">
<p>
Must understand input type and structure, using model, grammar, or
protocol based fuzz.
</p>
</div>
</li>
<li><a id="org39160fb"></a>Challenge 5: Speed<br />
<div class="outline-text-5" id="text-1-4-2-5">
<p>
To help with speed:
</p>
<ul class="org-ul">
<li>initialize once and fork for other inputs</li>
<li>replace costly resources with cheaper ones</li>
<li>run many inputs on a single process</li>
<li>minimize the # of test cases, discarding redundant ones</li>
<li>run in parallel, distributed</li>
</ul>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgc5a2b65" class="outline-3">
<h3 id="orgc5a2b65"><span class="section-number-3">1.5.</span> Problems with Fuzzing</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Many false positive that are expensive.
</p>

<p>
Focus on code coverage, which is less important than reasonable inputs.
</p>

<p>
Cleaning to make random input more reasonable:
</p>
<ul class="org-ul">
<li><b>minimization</b>: eliminate redundant test failures through diffing</li>
<li><b>triage</b>: finding similar outputs/stackdumps and grouping them in bug report</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-02-21 Wed 16:55</p>
</div>
</body>
</html>
